app/services/account_service.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 2607.03], ["updated_at", "2022-05-18 22:33:53.358444"], ["id", 32]]
---
  def add_balance(account_id, value)
    account = Account.where(id: account_id).first
    balance = account.balance + value
    account.update(balance: balance)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 1496.0], ["updated_at", "2022-05-18 22:32:19.777845"], ["id", 35]]
---
  def subtract_balance(account_id, value)
    account = Account.where(id: account_id).first
    balance = account.balance - value
    account.update(balance: balance)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 966.0], ["updated_at", "2022-05-21 14:50:21.151190"], ["id", 32]]
---
  def update_balance(account_id, values)
    account = Account.where(id: account_id).first
    difference = values[0] - values[1]
    account.balance += difference
    account.save