app/controllers/accounts_controller.rb

  def show
    @account = redis_client.hgetall("account:#{params['id']}")
    @entries = get_all_records("entry").select { |entry| entry['account_id'] == @account['id'] }
---
SELECT "entries".* FROM "entries" WHERE "entries"."account_id" = $1  [["account_id", 27]]

  def destroy
    redis_client.del("account:#{params['id']}")
    account_entries = get_all_records("entry").select { |entry| entry['account_id'] == params['id'] }
---
SELECT "entries".* FROM "entries" WHERE "entries"."account_id" = $1  [["account_id", 26]]