app/controllers/accounts_controller.rb

  def show
    @account = Account.where(id: params['id']).first
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def create
    account = params['account']
    Account.create(name: account['name'], color: account['color'], balance: account['balance'])
---
INSERT INTO "accounts" ("name", "color", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Poupança"], ["color", "#8a0f0f"], ["balance", 3000.0], ["created_at", "2022-05-16 12:20:16.209874"], ["updated_at", "2022-05-16 12:20:16.209874"]]

  def edit
    @account = Account.where(id: params['id']).first
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 30], ["LIMIT", 1]]

  def update
    account = Account.where(id: params['id']).first
    account_params = params['account']
    account.update(name: account_params['name'], color: account_params['color'], balance: account_params['balance'])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "accounts" SET "name" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["name", "Poupança aaaaaaaa"], ["updated_at", "2022-05-16 12:20:25.335672"], ["id", 31]]

  def destroy
    Account.where(id: params['id']).first.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 36]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 36], ["LIMIT", 1]]