app/controllers/dashboard_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = get_all_records("account").select {|account| account['user_id'] == current_user.id.to_s }