app/controllers/entries_controller.rb

  def new
    @entry = Entry.new
    @accounts = Account.all.pluck(:name, :id)
---
SELECT "accounts"."name", "accounts"."id" FROM "accounts"

  def create
    data = params.require(:entry).permit(Entry.allowed_params)
    entry = Entry.create(data)
---
INSERT INTO "entries" ("title", "description", "account_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Salgado pro lain"], ["description", "#a54a4a"], ["account_id", 27], ["value", 3], ["created_at", "2022-05-16 01:01:53.552780"], ["updated_at", "2022-05-16 01:01:53.552780"]]

  def edit
    @entry = Entry.where(id: params['id']).first
    @accounts = Account.all.pluck(:name, :id)
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "accounts"."name", "accounts"."id" FROM "accounts"

  def update
    entry = Entry.where(id: params['id']).first
    data = params.require(:entry).permit(Entry.allowed_params)
    entry.assign_attributes(data)
    value_changes = entry.changes['value']
    entry.save

    if value_changes.present?
      if entry.type_id == 1
        values = value_changes[0] - value_changes[1]
      elsif entry.type_id == 2
        values = value_changes[1] - value_changes[0]
      end
      account_service.update_balance(entry.account_id, values)
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "entries" SET "value" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["value", 5], ["updated_at", "2022-05-21 14:45:17.050306"], ["id", 21]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 1857.0300000000002], ["updated_at", "2022-05-21 14:22:18.950350"], ["id", 32]]

  def destroy
    entry = Entry.where(id: params['id']).first
    # account_service.add_balance(entry.account_id, entry.value)
    if entry.type_id == 1
      account_service.add_balance(entry.account_id, entry.value)
    elsif entry.type_id == 2
      account_service.subtract_balance(entry.account_id, entry.value)
    end
    entry.destroy
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" ORDER BY "entries"."id" ASC LIMIT $1  [["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 2]]